{
  "layout": "post",
  "title": "January 2024 Progresss update",
  "image": "/assets/blog/january-2024-progress-update.png",
  "permalink": "/blog/january-2024-progress-update",
  "type": "blog",
  "previewText": "Well, hasn't it been a few busy months? We'll talk more about that at the bottom though, lets get to it!\n",
  "mainText": "Well, hasn't it been a few busy months? We'll talk more about that at the bottom though, lets get to it!\n\n### What's new?\n\nYou may not have noticed, but LEM has been updated! The following changes are now available:\n\n- **Updated to 1.20.4** LEM now runs on the latest Minecraft version, 1.20.4.\n\n- **Improved player spawning** During the start of a match players are now locked in place with a much more stable system than before.\n\n  <div style=\"font-size: 0.70em;\">The old system relied on boats. Yes, <i>boats.</i><br></div>\n\n- **Improved music quality** The audio quality of most of the music (every song besides the vanilla pack) has been improved.\n\n- **Smaller resource downloads** The size of the resource packs have been decreased significantly.\n\n- **Snow now appears in the Festive lobby** Not sure why we didn't do this sooner, the weather condition is now set to snowing in the Festive lobby.\n\n- **Redesigned Logos** The LEM Logos have been redesigned again, this is to avoid concerns regarding Minecraft's branding guidelines.\n\n- **Official YouTube channel** LEM now has an [official YouTube channel](https://www.youtube.com/channel/UCATvhUMrXp4d-gwtW0uL0MA)! No videos have been uploaded there yet but the trailer will be moved there soon, expect things like demonstrations of new features to be uploaded there. We'll also probably do livestreams there too!\n\n- **R26.8 released** Resource version 26.8 has been released, you can find the full changelog [here](https://github.com/Legacy-Edition-Minigames/Minigame-Resources/releases/tag/R26.8).\n\n- **New domain** We have a new domain again, more information can be found on [this blogpost](new-domain)\n\n### What's being worked on?\n\n- **ModTools Version 2 is currently undergoing development** ModTools 2 is currently in the very early stages of development, while we don't have too much to show for it at the moment we will share our plans for it!\n\n  The following features are currently planned for the first major ModTools update:\n\n  - **Overhauled map editor** Map editing will get a complete overhaul. Adding better visuals while improving functionality.\n\n  - **Live map testing** Quickly start a battle match to test your map without needing to run the compiler or anything, all battle features will be available with this. It will act as if you just loaded the map onto a standard LEM server.\n\n  - **Better integration** There will no longer be a need for the ModTools installer to be run to use mods on a server, you will simply put your mod files into a folder and run the server.\n\n  - **DataPack Loading** Mods will be able to bundle datapacks with them to expand their functionality.\n\n  - **Lobby mods** It will be possible to make custom lobby maps.\n\n  - **Custom resources** Mods will be able to add custom resource packs and music.\n\n  - **NBS Music** Loading music through a .nbs file will be possible as an alternative to adding a song file to a resource pack.\n\n  Do keep in mind none of this is finalized and could be changed during the development plans, more things could be added, some things tweaked, etc.\n\n  It will likely be a while until all of these features are available, we will provide more details about them as it develops!\n\n### Closing notes\n\nYou don't mind if I stop with being super professional for everything and let me talk a bit more personally for a moment do you?\n\nWell, turns out I ended up skipping 2 months of progress updates. What's going on?\n\nThe past few months have been real busy for all of us outside of this project with holidays and other things going on in our lives. On top of this a lot of the changes that have been happening have been backend changes not visible to the average player and bug fixes which usually are not worth mentioning in progress updates. Do you really want to hear about hunger breaking if you joined at a specific time? Or the backend getting moved into the minecraft server instead of being a standalone thing?\n\nChances are, this is will not be the last time we miss a progress update. Feburary will likely be missed due to how late this one is being written. Which has gotten me reconsidering how we should be handling these progress updates given they've been real inconsistent lately. I might ditch the monthly idea and just make them whenever a notable amount of changes have been made, with the condition that there can only be one in each month.\n\nNone of this is decided, but I just wanted to give you a heads up that there's probably going to be a change in how often we post these and how they're named.\n\nSee you next time, thanks for reading this whole thing to the end!\n\n\\- Emmie\n",
  "markdown": true
}